import getServe from "./index";

/*
| 编号\条件 | 航线   | 时间 | 舱位   | 期望结果        |
| --------- | ------ | ---- | ------ | --------------- |
| 1         | ${"欧美"}   | 3    | ${"经济舱"} | ${["食物","电影"]} |
| 2         | ${"非欧美"} | 3    | ${"经济舱"} | ${["食物"]}        |
| 3         | ${"非欧美"} | 3    | ${"商务舱"} | ${["食物","电影"]} |
| 4         | ${"国内"}   | 3    | ${"经济舱"} | ${["食物"]}        |
| 5         | ${"国内"}   | 3    | ${"商务舱"} | ${["食物"]}        |
| 6         | ${"国内"}   | 1    | ${"经济舱"} |  ${[]}            |
*/

test.each`
  airLine     | during | space       | result
  ${"欧美"}   | ${3}   | ${"经济舱"} | ${["食物", "电影"]}
  ${"非欧美"} | ${3}   | ${"经济舱"} | ${["食物"]}
  ${"非欧美"} | ${3}   | ${"商务舱"} | ${["食物", "电影"]}
  ${"国内"}   | ${3}   | ${"经济舱"} | ${["食物"]}
  ${"国内"}   | ${3}   | ${"商务舱"} | ${["食物"]}
  ${"国内"}   | ${1}   | ${"经济舱"} | ${[]}
`("当航线是$airLine,舱位是$space,飞行时间$during,返回$result", ({ airLine, during, space, result }) => {
  const r = getServe(airLine, space, during);
  expect(r).toEqual(result);
});
